{
  "architectures": [
    "XLMRobertaForMaskedLM"
  ],
  "model_type": "xlm-roberta",
  "vocab_size": 32,
  "hidden_size": 64,
  "num_hidden_layers": 2,
  "num_attention_heads": 4,
  "intermediate_size": 64,
  "max_position_embeddings": 8,
  "type_vocab_size": 1,
  "layer_norm_eps": 1e-05,
  "hidden_act": "gelu",
  "is_causal": false,
  "tie_word_embeddings": false
}