{
  "architectures": [
    "DebertaV2ForMaskedLM"
  ],
  "model_type": "deberta-v2",
  "hidden_size": 64,
  "num_hidden_layers": 1,
  "num_attention_heads": 4,
  "intermediate_size": 128,
  "hidden_act": "gelu",
  "max_position_embeddings": 16,
  "vocab_size": 32,
  "type_vocab_size": 0,
  "position_biased_input": false,
  "layer_norm_eps": 1e-07,
  "relative_attention": true,
  "max_relative_positions": 8,
  "pos_att_type": [
    "p2c",
    "c2p"
  ],
  "share_att_key": true,
  "norm_rel_ebd": "none",
  "position_buckets": -1,
  "attention_probs_dropout_prob": 0.0,
  "hidden_dropout_prob": 0.0,
  "rope_theta": 0,
  "rms_norm_eps": 1e-07,
  "tie_word_embeddings": false,
  "num_key_value_heads": 4,
  "is_causal": false
}