{
  "architectures": ["Lfm2VlForConditionalGeneration"],
  "model_type": "lfm2_vl",
  "image_token_id": 396,
  "downsample_factor": 2,
  "projector_hidden_size": 2560,
  "text_config": {
    "model_type": "lfm2",
    "architectures": ["Lfm2ForCausalLM"],
    "hidden_size": 1024,
    "intermediate_size": 6656,
    "num_hidden_layers": 16,
    "num_attention_heads": 16,
    "num_key_value_heads": 8,
    "max_position_embeddings": 128000,
    "rope_theta": 1000000.0,
    "rms_norm_eps": 1e-6,
    "block_norm_eps": 1e-05,
    "block_ff_dim": 6656,
    "block_auto_adjust_ff_dim": true,
    "block_multiple_of": 256,
    "conv_L_cache": 3,
    "conv_bias": false,
    "conv_dim": 1024,
    "conv_dim_out": 1024,
    "vocab_size": 65536,
    "tie_word_embeddings": false,
    "layer_types": [
      "conv", "conv", "full_attention", "conv", "conv",
      "full_attention", "conv", "conv", "full_attention", "conv",
      "full_attention", "conv", "full_attention", "conv",
      "full_attention", "conv"
    ]
  },
  "vision_config": {
    "model_type": "siglip2",
    "hidden_size": 768,
    "intermediate_size": 3072,
    "num_hidden_layers": 12,
    "num_attention_heads": 12,
    "image_size": 256,
    "patch_size": 16,
    "num_channels": 3,
    "layer_norm_eps": 1e-6
  }
}
